src/cf/DataProcessors/ЗагрузкаИзОФД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаИзОФД</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиКассОФД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКассОФД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКОФД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РегистрационныйНомерККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаводскойНомерФН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Магазин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКассы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийИспользования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КассаОФДБИП</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ЗагрузкаИзОФД/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.КассыОФДНоваяНастройка.Видимость = ОФДСлужебный.НастройкаПодключенияДоступна();
	
	ОбновитьСписокКасс();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если НЕ СтрНачинаетсяС(ИсточникВыбора.ИмяФормы, "Обработка.ЗагрузкаИзОФД.Форма.НастройкаПодключения") Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение[0].ЗагрузитьДанные Тогда
		ОповеститьОВыборе(ВыбранноеЗначение);
	Иначе
		ОбновитьСписокКасс();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Загрузить(Команда)
	СписокКасс = Новый Массив;
	Для каждого НастройкаКассыОФД Из СписокНастроек Цикл
		Если НастройкаКассыОФД.Загружать ИЛИ СписокНастроек.Количество() = 1 Тогда
			СписокКасс.Добавить(Новый Структура("ИдентификаторУстройства, ЗагрузитьДанные, ПериодИзмененВручную", НастройкаКассыОФД.ИдентификаторУстройства, Истина, НастройкаКассыОФД.ПериодИзмененВручную));
		КонецЕсли;
	КонецЦикла;
	
	Если СписокКасс.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбраны кассы для загрузки'"));
		Возврат;
	КонецЕсли;
	
	ОповеститьОВыборе(СписокКасс);
КонецПроцедуры 

&НаКлиенте
Процедура НоваяНастройка(Команда)
	ОткрытьФОрму(
		"Обработка.ЗагрузкаИзОФД.Форма.НастройкаПодключения",,ЭтотОбъект,,,,,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура Отключить(Команда)
	ТекущиеДанные = Элементы.СписокКассыОФД.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не выбрана касса для отключения'"));
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("НастройкаПодключения, РегистрационныйНомерККТ, ИдентификаторУстройства");
	
	ЗаполнитьЗначенияСвойств(ДополнительныеПараметры, ТекущиеДанные);
	
	Оповещение = Новый ОписаниеОповещения("ОтключитьКассуПослеЗакрытияВопроса", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(
		Оповещение,
		НСтр("ru = 'Отключить получение данных от ОФД по кассе?'"),
		РежимДиалогаВопрос.ДаНет);
	Возврат;
КонецПроцедуры 

&НаКлиенте
Процедура ОтметитьВсе(Команда)
	Для каждого Настройка Из СписокНастроек Цикл
		Настройка.Загружать = ИСтина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметку(Команда)
	Для каждого Настройка Из СписокНастроек Цикл
		Настройка.Загружать = Ложь;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОтборОрганизацияИспользование = ЗначениеЗаполнено(ОтборОрганизация);
	ОбновитьСписокКасс();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияИспользованиеПриИзменении(Элемент)
	ОбновитьСписокКасс();
КонецПроцедуры

#КонецОбласти

#Область ОБработчикиСобытийТаблицыСписокКассыОФД

&НаКлиенте
Процедура СписокКассыОФДПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;       
	ОписаниеОповещения = НОвый ОписаниеОповещения("НоваяНастройкаЗавершение", ЭтотОбъект, Новый Структура());
	ОткрытьФОрму(
		"Обработка.ЗагрузкаИзОФД.Форма.НастройкаПодключения",,ЭтотОбъект,,,,ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура СписокКассыОФДПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОбновитьСписокКасс()
	Если ОтборОрганизацияИспользование Тогда
		СписокКассПоОрганизации = Обработки.ЗагрузкаИзОФД.СписокНастроекКассОФД(ОтборОрганизация);
	Иначе
		СписокКассПоОрганизации = Обработки.ЗагрузкаИзОФД.СписокНастроекКассОФД(Неопределено);
	КонецЕсли;
	
	СписокНастроек.Очистить();
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(СписокКассПоОрганизации, СписокНастроек);
	
	Элементы.КассыОФДЗагружать.Видимость = СписокНастроек.Количество() > 1;
	Элементы.КассыОФДКомандаВыделения.Видимость = СписокНастроек.Количество() > 1;
КонецФункции

&НаКлиенте
Процедура ОтключитьКассуПослеЗакрытияВопроса(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Операция отключения кассы на портале.'");
	
	РезультатВыполнения = ОтключитьКассуЗапускЗадания(
		ДополнительныеПараметры.РегистрационныйНомерККТ,
		ДополнительныеПараметры.НастройкаПодключения,
		ЭтотОбъект.УникальныйИдентификатор);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ОтключитьКассуЗавершение",
		ЭтотОбъект);
	
	Если РезультатВыполнения.Статус = "Выполнено" Или РезультатВыполнения.Статус = "Ошибка" Тогда
		ОтключитьКассуЗавершение(РезультатВыполнения, ДополнительныеПараметры);
		Возврат;
	КонецЕсли;
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
		РезультатВыполнения,
		ОповещениеОЗавершении,
		ПараметрыОжидания);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтключитьКассуЗапускЗадания(
	Знач РегистрационныйНомерККТ,
	Знач НастройкаПодключения,
	Знач УникальныйИдентификатор)
	
	ПараметрыФункции = Новый Структура;
	ПараметрыФункции.Вставить("РегистрационныйНомерККТ", РегистрационныйНомерККТ);
	ПараметрыФункции.Вставить("НастройкаПодключения",    НастройкаПодключения);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Отключение кассы на портале.'");
	
	РезультатВыполнения = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения,
		"СервисИнтеграцииСОФД.ОтключитьКассу",
		ПараметрыФункции);
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОтключитьКассуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатОперации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		Если ЗначениеЗаполнено(РезультатОперации.КодОшибки) Тогда
			ПоказатьПредупреждение(
				Неопределено,
				РезультатОперации.СообщениеОбОшибке);
		Иначе
			
			УдалитьНастройкиКассы(ДополнительныеПараметры.ИдентификаторУстройства);
			
			ПоказатьПредупреждение(
				Неопределено,
				НСтр("ru = 'Отключение кассы завершено успешно.'"));
				
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		ПоказатьПредупреждение(
			Неопределено,
			Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
		
	ОбновитьСписокКасс();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УдалитьНастройкиКассы(Знач КассаОФД)
	
	РегистрыСведений.НастройкиКассОФД.УдалитьНастройкиКассы(КассаОФД);
	
КонецПроцедуры

#КонецОбласти
